import { Component, OnInit } from '@angular/core';

import { Catalog } from 'src/app/Entities/Catalog';

@Component({
  selector: 'app-catalog',
  templateUrl: './catalog.component.html',
  styleUrls: ['./catalog.component.css']
})
export class CatalogComponent implements OnInit {

  catalogs: Catalog[] = [];
  
  constructor() {
    this.catalogs = [
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat1.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat2.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat3.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat4.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      new Catalog(1, "../../assets/cat5.jpeg", "مجموعة التحكم 4 في 1 لألعاب الهاتف ", 26, "33", 0.3, "g-g 05", "الصين", "كفالة تشغيلية", "ممتازة", ""),
      
    ];
  }

  ngOnInit(): void {
  }





}
